import photo1_1 from '../assets/images/subjectOne/photo1.jpg'
import photo1_2 from '../assets/images/subjectOne/photo2.jpg'
import photo2_1 from '../assets/images/subjectOne/photo3.jpg'
import photo3_1 from '../assets/images/subjectOne/photo4.jpeg'
import photo4_1 from '../assets/images/subjectOne/photo5.jpg'

export const subjects = [
    {
        name: 'Взаимотношение кыргызов с средними народами и государствами',
        url: 'moduleII-topicI'
    },
    {
        name: 'Присоединение Кыргызстана к царской России',
        url: 'moduleII-topicII'
    },
    {
        name: 'Кыргызстан - колония Российской империи (1855-1986г.)',
        url: 'moduleII-topicIII'
    },
    {
        name: 'Восстание 1916г. в Кыргызстане',
        url: 'moduleII-topicIV'
    },
    {
        name: 'Установление Советской Власти в Кыргызстане. Гражданская война',
        url: 'moduleII-topicV'
    },
]



export const subjectsInfo = [
    {
        title: 'Взаимотношение кыргызов с средними народами и государствами',
        url: 'moduleII-topicI',
        chronology: {
            oldest: 1758,
            newest: 1760,
        },
        subtopics: [
            {
                title: 'Кыргызско-казахские отношения',
                structure: [
                    {
                        type: 'text',
                        content: 'Продвижение Цинской империи к рубежам Центральной Азии вызвало вполне обоснованную тревогу и опасение среднеазиатских народов. По поступившим в июне 1758 г. в Оренбург сведениям, «войска де китайского в тамошней стороне находитца осемнадцть Санов (сто восемьдесят тысяч.) и располагаются на границе той пустой калмыцкой земли к вершине Сырь-Дарьи, два сана против киргизов в горах живущих, два сана против степи киргис-кайсацкой, шесть санов против Средней орды, шесть же против Сибирских линий и последним двум санам находящимся указано бегающих калмык в Россию и в тое Среднюю орду, располагаясь партиями, не допущать... И тако от толь немалочисленного народа и киргас-кайсаки все ныне в великой опасности и боязни находяться, дабы оные войска нечаянно на них нападения учинить не могли». Военные приготовления цинского двора с целью изоляции восставших восточнотуркестанцев от среднеазиатских народов еще более обнажили их далеко идущие завоевательные планы.',
                    },
                    {
                        type: 'text',
                        content: 'В создавшейся обстановке среднеазиатские народы-- кыргызы, казахи и узбеки -- стремились сохранить свои земли в неприкосновенности. Для этих целей были применены все средства, не исключая и посольско-дипломатические. Так, некоторые кыргызские и казахские правители, откликнувшись на призыв цинского двора об установлении дипломатических связей, отправив своих послов в Пекин, одновременно исподволь начали переговоры между собой о союзе для совместного отпора на случай вторжения иноземцев. Об этом свидетельствуют строки из сообщения купца А. Шихова от 29 августа 1758 г.;'
                    },
                    {
                        type: 'image',
                        content: photo1_1,
                        description: {
                            number: 1,
                            title: 'Взаимотношения кыргызов с кераитами, найманами и меркитами'
                        }
                    },
                    {
                        type: 'text',
                        content: '«Июня 1 числа приезжал к Аблай солтану посол от узбяков, кои называются и киргисцами, а кочуют оные за бухарским городом Ташкенд, коих там состоят весьма многолюдно, коими владеет Ирденяби (Ирдана-бий.) Регимбиев сын, от которых посольство было в такой силе, что к реченному узбякскоу владельцу Ирде-няби приезжали ис китайского войска послы и спрашивали, что они узбяки в согласии (ли) с Аблай солтаном находяться. И естли де в согласии, то они китайцы их уз-бяков разорять не станут. А ежели в не согласии, то всех искоренить намерены. И они узбякитем послам, объявили (что) с Аблай солтаном состоят в согласии. Чего ради и к Аблай солтану то посольство учинили, дабы и он об них китайцам объявил против чего Аблай солтан о том объявлении и учинить обещался и подписками объязался». О заключении дружественного договора между Ирданой и кыргызским Аджи-бием в июне 1758 г. сообщается в «Пиндин чжуньгээр...» (гл 78, с. 13а): «Во главе с беком (Ирданой) четыре человека все под водительством бия адыгене Хаджи заключили дружбу с кокандским Ирдана беком».'
                    },
                    {
                        type: 'text',
                        content: 'В начале 1759 г. восточнотуркестанцы, ожидая нового наступления цинской армии, присылали своих послов к кыргызам, казахам и узбекам с просьбой о помощи. А когда эти послы прибыли в Ташкент, то, по свидетельству купца Усена Сеюшева, «ташкенцы против китайцев с ними яркенцами обще воевать и друг друга не выдавать обещались».'
                    }
                ]
            }
        ]
    },
    {
        title: 'Присоединение Кыргызстана к царской России',
        url: 'moduleII-topicII',
        chronology: {
            oldest: 1758,
            newest: 1760,
        },
        subtopics: [
            {
                title: 'В составе Российской империи',
                structure: [
                    {
                        type: 'text',
                        content: 'К концу первой половины XIX века, Кокандское ханство погрязло в дворцовых интригах и в насилии, чем окончательно оттолкнуло от себя северных киргизов. Сопротивляясь экспансии Империи Цин отдельные северные киргизские племена начали принимать российское подданство. В 1855 году племя бугу приняло российское подданство, что означало начало процесса присоединения территории современной Киргизии к России.'
                    },
                    {
                        type: 'text',
                        content: 'В 1855—1863 территория современной Северной Киргизии была отвоёвана у Кокандского ханства отрядами полковника Черняева и вошла в состав Российской империи. Ряд киргизских вождей сопротивлялись российскому завоеванию. Территория Ферганской долины (включающей территорию современной Южной Киргизии, ряда регионов современного Узбекистана вместе с севером современного Таджикистана) после разгрома Кокандского ханства в 1876 году была включена в состав Российской империи в качестве Ферганской области (административный центр — город Новый Маргелан). Территория современной Северной Киргизии вошла в состав Семиреченской области с центром в г. Верный (совр. Алма-Ата).'
                    },
                    {
                        type: 'image',
                        content: photo1_2,
                        description: {
                            number: 1,
                            title: 'Вхождение кыргызского племени Бугу в состав России 160 лет'
                        }
                    },
                    {
                        type: 'text',
                        content: 'С 1867 по 1918 год территория современной Киргизии была частью Российской империи в составе Туркестанского генерал-губернаторства. Туркестан долгое время оставался колониальным форпостом, изолированным от европейской части империи, однако появление железных дорог на рубеже XX века способствовало появлению большого количества русских переселенцев, которые занимали и использовали и без того ограниченные земельные и водные ресурсы. Переселенческая и налоговая политика царизма усиливала национальный и экономический гнёт. Первое антиколониальное выступление народов Средней Азии произошло в Ферганской долине в 1898 г. в г. Андижане.'
                    },
                    {
                        type: 'text',
                        content: '8 июля 1916 г. император Николай II подписал указ о привлечении инородческого населения империи для работ по устройству оборонительных сооружений и военных сообщений в районе действующей армии. Так началось Туркестанское восстание 1916 года. Восстание было жестоко подавлено. Большая часть киргизов и казахов Семиреченской области бежала в Китай от царских карателей.'
                    }
                ]
            }
        ]
    },
    {
        title: 'Кыргызстан - колония Российской империи (1855-1986г.)',
        url: 'moduleII-topicIII',
        chronology: {
            oldest: 1758,
            newest: 1760,
        },
        subtopics: [
            {
                title: 'Киргизия в составе Российской империи',
                structure: [
                    {
                        type: 'text',
                        content: 'Присоединение киргизских земель к России началось в середине 1850-х годов. Первыми приняли российское подданство иссык-кульские киргизы, затем киргизы Чуйской долины, Тянь-Шаньских гор и Таласской долины (к 1863 году северные районы Киргизии вошли в состав Российской империи). Южная Киргизия была присоединена в 1876 году после ликвидации контролировавшего её Кокандского ханства, с которым происходили основные столкновения при продвижении русских войск в Среднюю Азию. Территория расселения киргизов была разделена между Туркестанским (Сырдарьинская, Ферганская и Самаркандская области) и Степным (Семиреченская область) генерал-губернаторствами. В систему управления генерал-губернаторствами привлекались представители местных землевладельцев — баи, манапы и др.'
                    },
                    {
                        type: 'text',
                        content: 'Появление России в хозяйственной сфере Средней Азии вызвало значительные социально-экономические изменения. Было отменено патриархальное рабство, упорядочен сбор налогов, прекращены междоусобицы. Началось переселение на частично изъятые в колониальный фонд киргизские земли казаков и крестьян из центральных и южных областей России (этот процесс ускорился в связи с аграрной реформой П. А. Столыпина), что косвенно способствовало переходу части кочевых киргизов к оседлому образу жизни, освоению ими прогрессивных способов сельскохозяйственного производства (часть киргизов при этом откочёвывала дальше на юг). По мере интенсификации экономического развития других частей Средней Азии, вызванного ростом потребления ресурсов со стороны промышленности метрополии и политической стабильностью, на территории Киргизии были основаны обрабатывающие производства, в том числе хлопкоочистительное, горнодобывающие промыслы (добыча угля, нефти). Появились первые элементы современной системы образования (светские школы) и здравоохранения.'
                    }
                ]
            },
            {
                title: 'Конфликты с Русской империей',
                structure: [
                    {
                        type: 'image',
                        content: photo2_1,
                        description: {
                            number: 1,
                            title: 'Народные волнения с участием кыргызов'
                        }
                    },
                    {
                        type: 'text',
                        content: 'Расширение присутствия Российской империи в Средней Азии также сопровождалось нарастанием социально-экономических противоречий. Во-первых, русские переселенцы способствовали распространению не только капиталистических отношений, но и революционных идей, хотя они и не пользовались популярностью вне довольно узкой среды рабочих. Во-вторых, изъятие земель в колониальный фонд вело к сокращению наделов или их потере местными крестьянами, выросло налоговое бремя. В-третьих, не были ликвидированы традиционные повинности населения в пользу киргизских землевладельцев, сохранивших свои владения. Ситуация резко ухудшилась во время Первой мировой войны, что было вызвано быстрым ростом цен, массовым вывозом скота и зерна в метрополию, мобилизацией на трудовые работы. В результате в Средней Азии в 1916 году вспыхнуло восстание, для подавления которого были привлечены войска. Тысячи киргизов бежали в соседний Китай.'
                    }
                ]
            }
        ]
    },
    {
        title: 'Восстание 1916г. в Кыргызстане',
        url: 'moduleII-topicIV',
        chronology: {
            oldest: 1758,
            newest: 1760,
        },
        subtopics: [
            {
                title: 'Причины восстания',
                structure: [
                    {
                        type: 'text',
                        content: 'В многовековой истории кыргызского народа и Кыргызстана много как героических и славных событий, которыми мы по праву гордимся, так и трагических, и печальных. Самыми трагическими страницами в истории кыргызского народа ХХ в. стали события национально-освободительного восстания 1916 г. Как известно, без осмысления прошлого трудно понять настоящее и построить будущее. Поэтому важно сохранить историческую память об этой важной вехе в истории кыргызского народа.'
                    },
                    {
                        type: 'image',
                        content: photo3_1,
                        description: {
                            number: 1,
                            title: 'Восстание 1916г. в Кыргызстане'
                        }
                    }
                ]
            },
            {
                title: 'Первая причина',
                structure: [
                    {
                        type: 'text',
                        content: 'Колониальный гнет и жестокая эксплуатация народов, в т.ч. кыргызов, увеличение налогов и поборов. Так, местное и русское население края были обложены кибиточной податью, государственными оброчной податью и налогом на городское недвижимое имущество, основным промысловым налогом. Они обязаны были также нести натуральные повинности по устройству и ремонту дорог, ирригационных систем, земские сборы и т.п. Одним из основных налогов, взимаемых с кыргыза-скотовода, была так называемая «кибиточная подать». К 1908 г. она увеличилась с 1 руб. 50 коп. до 4 руб. Поземельный налог взимался с русских крестьян-переселенцев и коренного населения, которое занималось земледелием. Он составлял 10% годового дохода от земледелия.' 
                    },
                    {
                        type: 'text',
                        content: ' Земский сбор требовалось выплатить вперед за год. В начале ХХ в. этот сбор составлял 1 руб. 58 коп. с каждого двора и кибитки, 33% оброчной подати, или 25% кибиточного налога.'
                    },
                    {
                        type: 'text',
                        content: 'С 1905 г. коренное население облагалось налогом и за то, что оно не несло воинскую повинность. Этот налог составлял 5% кибиточной подати, 10% поземельного сбора или 15% оброчной подати. Существовали также государственный промысловый налог, акцизный сбор и таможенная пошлина. С населения взимался гербовый сбор и таможенная пошлина за безвозмездный переход имущества от одного лица к другому.'
                    }
                ]
            },
            {
                title: 'Вторая причина',
                structure: [
                    {
                        type: 'text',
                        content: 'Массовое переселение русских крестьян в Среднюю Азию и Казахстан, которым передавались самые удобные для земледелия земли. Крестьяне-переселенцы презрительно относились к местному населению (кыргызам, казахам, узбекам и др.), захватывали водные источники, перекрывали воду, вынуждая их бросать свои наделы и перекочевывать. Кулаки-переселенцы, казачья верхушка не останавливались перед открытым грабежом и даже истреблением коренных жителей. Об этом свидетельствуют многочисленные телеграммы и прошения кыргызов и казахов, адресованные правительству. Так, в телеграмме доверенных кыргызов Шамшинской волости Пишпекского уезда Б. Тулекабылова и М. Кулова от 5 апреля 1917 г. говорилось, что русские кулаки «отбирают нашу киргизскую землю и запахивают ее, рубят лес, разрушают постройки, уничтожают сады и клеверники, угрожают перебить киргизов1, никакой власти в уезде нет и защищать нас некому» [2, с.145].'
                    }
                ]
            },
            {
                title: 'Третья причина',
                structure: [
                    {
                        type: 'text',
                        content: 'Обезземеливание кыргызов. Так, к 1916 г. 6 % русского населения в Семиреченской области занимали 57,7% пригодных для возделывания земель, а 94% местного населения занимали 42,3%. Вскоре они теряют и эти земли, и уже арендуют землю у казны: в 1913–1916 гг. в Семиреченской области 60% арендаторов, бравших землю в годичную аренду, были кыргызы. На одного русского крестьянина в Туркестане приходилось в среднем 3,17 дес., а на одного коренного жителя – только 0,21 дес., т.е. в 15 раз меньше [3, с.5]. В 1916 г. из 598 659 десятин земли взято в годичную аренду, из них 485 770 десятин приходилось на кыргызов, как наиболее нуждавшихся в ней.'
                    }
                ]
            },

        ]
    },
    {
        title: 'Установление Советской Власти в Кыргызстане. Гражданская война',
        url: 'moduleII-topicV',
        subtopics: [
            {
                title: 'Установление Советской Власти',
                structure: [
                    {
                        type: 'image',
                        content: photo4_1,
                        description: {
                            number: 1,
                            title: 'Установление Советской Власти'
                        }
                    },
                    {
                        type: 'text',
                        content: 'Национально-освободительное движение. Февральская революция 1917, несмотря на свержение царя, не смогла установить по всей России новую, устойчивую общественно-политическую формацию. Временное правительство не сумело провести в жизнь свою реформаторскую программу. В Туркестанском регионе Российской империи прежняя колониальная политика сохранилась без изменений. Кыргызский, казахский и узбекский народы не добились подлинной независимости. Прежние же высокопоставленные чиновники, проводившие царскую колониальную политику, оставались у власти на местах. Кыргызам, бежавшим в 1916 в Китай, не была объявлена амнистия. Беженцы-кыргызы, возвращавшиеся на свою землю, убивались с особой жестокостью русскими кулаками.'
                    },
                    {
                        type: 'text',
                        content: 'Начиная с марта 1917, в Кыргызстане организовывались советы рабочих депутатов, руководители и члены к-рых состояли почти сплошь из представителей русской и европейской национальностей, а местное население было отдалено от деятельности советов. Это означало, что Февральская революция для кыргызской нации была всего лишь эхом навязываемой ей из внутренних регионов Российской империи крупной политической борьбы. Кыргызский народ, переживший геноцид 1916, поражение своей нац.-освободительной борьбы, в новую революцию втянулся не по собственной воле, а из-за того, что оказался в орбите интересов власти.'
                    },
                    {
                        type: 'text',
                        content: 'Революция, совершенная в Петрограде большевистской партией 25 октября (7 ноября) 1917, привела к установлению диктатуры пролетариата. Всероссийский 2 съезд Советов, прошедший в тот день, объявил о переходе власти к Советам и избрал Совет народных комиссаров. На съезде были приняты декреты «О земле» и «О мире», большевики огласили своё обещание предоставить «всем нациям, живущим в России, истинное право на национальное самоопределение».'
                    }
                ]
            },
            {
                title: 'Гражданская война в Кыргызстане',
                structure: [
                    {
                        type: 'text',
                        content: 'Установление советской власти в центре и на местах породило вооруженное сопротивление свергнутых эксплуататорских классов. Война началась во второй поло­вине 1918 г. и продолжалась вплоть до конца 1920 г. На юге Кыргызстана гражданская война была направлена в ос­новном на борьбу с басмачеством. Началось массовое вступление добровольцев в Красную Армию. Для борьбы с басмачами из дехкан Андижанского и Ошского уездов была создана так называемая Крестьянская армия. 7  декабря 1919 г. в селе Беловодское под руководством левых эсеров был поднят мятеж. Советская власть была свергнута, а ее представители повешены. Но уже 29 декабря уезд был очищен от контрреволюционеров. Для укрепления советской власти в Туркестане правительство 14 августа 1919 г. организовало Туркестанский фронт. Командую­щим был назначен наш земляк М.В. Фрунзе. Связь между Ташкентом и Россией была восстановлена. Но затем в г. Нарыне был совершен новый контрреволюционный переворот и взято в плен коман­дование дислоцированного там 23-го полка. Советские руководи­тели были убиты, 47 партийных и советских работников аресто­ваны. Была объявлена царская власть и начата подготовка к походу на Токмок и Пишпек. После ожесточенного сражения 16 ноября враг был раз­громлен. Остатки мятежников бежали в Китай. К концу ноября Нарынский уезд был полностью очищен от контрреволюционеров, советская власть восстановлена. Таким образом, гражданская война в Кыргызстане была в конце 1920 г, завершена.'
                    }
                ]
            }
        ]
    }
]